/*
 Створити програму для роботи Автозаправки у  режимах адміна та користувача
 У режимі адміна передбачити 	
	Поповнення заправки   пальним відповідного типу 
	Перегляд наявного пального кожного типу
	Зміна цін на пальне
	заправка кавового автомату
	Вилучення кешу(за пальне, за каву)
	Вивід статистики про продажі пального у літрах та грн.
	Вивід зароблених коштів(кожна  категорія окремо та сумарно)
У режимі користувача передбачити 		
	Заправка авто потрібним пальним( з видачею талона по оплаті)
		- на певну суму
		- певну кількість літрів
	замовлення кави
 */
public class Fuel
{
    public string Type { get; set; }
    public double Price { get; set; }
    public double Volume { get; set; }
    public void Show()
    {
        Console.WriteLine("------- fuel ---------");
        Console.WriteLine($":Type {this.Type}");
        Console.WriteLine($"Volume: {this.Volume}");
        Console.WriteLine($"Price: {this.Price}");
    }
}